Autodesk.Revit.DB.SolidOptions.GraphicsStyleId
Defines the graphics style id for the Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.SolidOptions.MaterialId
Defines the material id for the Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.SolidOptions.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new SolidOptions class with material and graphics style settings.
materialId:
The material id for the Solid.
graphicsStyleId:
The graphics style id for the Solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015